DECLARE PREDICATE P1 : 0 
DECLARE PREDICATE P2 : 1 
DECLARE PREDICATE P3 : 3 
DECLARE FUNCTION c : 0 
DECLARE FUNCTION f : 1 
DECLARE FUNCTION g : 2 
DECLARE VARIABLE x : 120 
DECLARE VARIABLE y : 121 
DECLARE VARIABLE z : 122 

EXIST[x] P1() | ~ P2(x) | ~ P2(1) | EXIST[z] ALL[y] P3(c() , f(z) , g(13, y) )